# Notebook 5: Pandas

In this notebook, we will look at the package `pandas`. `pandas` is built on top of `numpy` (see Notebook 4 for more on `numpy`) and specializes in dealing with heterogenous and/or missing data often stored in a labelled format. 

As this is an introductory course we will only give a brief introduction to `pandas` and a flavour of why it may be useful to you. For more information see the [`pandas` documentation here](https://pandas.pydata.org/pandas-docs/stable/).

The strength of `pandas` lies in it's ability to handle database and spreadsheet type operations that may be more familiar to users of languages such as `R` and `SQL`. 

 > **Note:** By convention, `pandas` is often aliased as `pd`.

In [2]:
import pandas as pd
import numpy as np

## Pandas dataypes

The world of `pandas` revolves predominantly around the `Series` and `DataFrame` datatypes. We shall look at each one of these in turn now.

### Pandas `Series`

A `pandas` `Series` object is an indexed one-dimensional array of data.`

In [7]:
example_series = pd.Series([2.1,3.9,4.2])
print(example_series)

0    2.1
1    3.9
2    4.2
dtype: float64

We can convert a `pandas` `Series` to a `numpy` `array` very easily using the `values` attribute and we can access the elements of a `Series` using square brackets in the same way we would a one-dimensional `numpy` array.

In [51]:
print(example_series.values)
print(example_series[0])
print(example_series[0:2])
print(example_series[example_series>3])

[2.1 3.9 4.2]
2.1
a    2.1
b    3.9
dtype: float64
b    3.9
c    4.2
dtype: float64

However, with a `pandas` `Series` we can change how we index the data. For example:

In [16]:
example_series = pd.Series([2.1,3.9,4.2],
                           index=['a', 'b', 'c'])

We can now access the data using our both own indices, much like with a Python `dict`, and numerical indices, like a Python `list`.

In [13]:
print(example_series['b'])
print(example_series[2])

3.9
4.2

In fact, we can even use `numpy` style array indexing syntax but on our own labels.

 > **Note**: This indexing, unlike `numpy`, is inclusive. For example, `'a':'b'` includes element `'b'`, unlike in `numpy` where `0:2` does not include element `2`.

In [19]:
print(example_series['a':'b'])

a    2.1
b    3.9
dtype: float64

 > **Note:** If we use a number as an index for a column; our indices take precedence over the inbuilt `numpy` like indexing. For example:

In [14]:
example_series = pd.Series([2.1,3.9,4.2],
                           index=[2, 'b', 'c'])
print(example_series[2])

2.1

We can construct a `pandas` `Series` object from a `dict` like so:

In [15]:
example_dict = {'a': 1, 'b': 33, 'c': 2}
print(example_dict)
print(pd.Series(example_dict))

{'a': 1, 'b': 33, 'c': 2}
a     1
b    33
c     2
dtype: int64

 > **Note:** If we use the `index` keyword when creating a `series` object from a `dict` only the object with a key in our `index` list will be retained. For example:

In [20]:
example_dict = {'a': 1, 'b': 33, 'c': 2}
print(example_dict)
print(pd.Series(example_dict, index=['a','c']))

{'a': 1, 'b': 33, 'c': 2}
a    1
c    2
dtype: int64

## Pandas `Dataframes`

A `pandas` `DataFrame` object can be thought of as a collection of aligned `pandas` `Series` objects, where by aligned we mean sharing the same index. We can construct a `DataFrame` from several `Series` using the `pandas.DataFrame` object. For example:

In [53]:
# Series of heights in inches
heights = pd.Series({'Pete': 69, 'Mo': 72, 'Katy': 64, 'Alex': 80})
# Series of weights in kg
weights = pd.Series({'Pete': 60, 'Mo': 80, 'Jay': 55, 'Claire': 70})

example_dataframe = pd.DataFrame({'heights': heights, 'weights': weights})

# In this notebook we can display a pandas dataframe in a
# nice format without printing just by typing the dataframes
# name.
example_dataframe

        heights  weights
Alex       80.0      NaN
Claire      NaN     70.0
Jay         NaN     55.0
Katy       64.0      NaN
Mo         72.0     80.0
Pete       69.0     60.0

We can also construct a `DataFrame` from a list of `dict`s like so:

In [54]:
# Series of heights in inches
heights = {'Pete': 69, 'Mo': 72, 'Katy': 64, 'Alex': 80}
# Series of weights in kg
weights = {'Pete': 60, 'Mo': 80, 'Jay': 55, 'Claire': 70}

example_dataframe = pd.DataFrame({'heights': heights, 'weights': weights})

example_dataframe

        heights  weights
Alex       80.0      NaN
Claire      NaN     70.0
Jay         NaN     55.0
Katy       64.0      NaN
Mo         72.0     80.0
Pete       69.0     60.0

Alternatively we can construct a `DataFrame` from a `numpy` array and label the columns using the `columns` argument:

In [55]:
example_dataframe = pd.DataFrame(
    np.random.randint(60,80, size=(2, 3)),
    columns=['heights', 'weights', 'favourite number'],
    index=['Joe', 'Catelyn'])

example_dataframe

         heights  weights  favourite number
Joe           65       72                67
Catelyn       79       65                79

## Getting indices

We can retrieve the indices from a `Series` or `DataFrame` easily using the `index` attribute.

In [40]:
print(example_series.index)
print(example_dataframe.index)

Index(['a', 'b', 'c'], dtype='object')
Index(['Joe', 'Catelyn'], dtype='object')

We can also receieve the column headers from a `DataFrame` using the `columns` attribute.

In [41]:
print(example_dataframe.columns)

Index(['heights', 'weights', 'favourite number'], dtype='object')

## Working with Pandas

The `pandas` datatypes are incredibly useful and efficient when dealing with heterogeneous data. In this section we will give a, by no means comprehenive, selection of useful functions that `pandas` offers. We will use the below `DataFrame` in the following examples.

In [206]:
example_dataset = pd.DataFrame.from_dict({
                    'eyelash_length': np.random.rand(50),
                    'subject_ID': np.arange(50),
                    'birth_year': np.random.randint(1980, 1990, size=50),
                    'group': list('aabcdeacbeabcabcdeeedcdaebcaeddeacbeabcaddabbcecdb'),
                    'sex': list('MMMFMFFMFFMMMFMFFMFFMFMFFMFMMFFFMFFFMFMMFMMFFFMFMF')
})

# Add in some missing data
rows = np.random.randint(0,50,size=10)
cols = np.random.randint(0,5,size=10)
for i in range(10):
    example_dataset.iloc[rows[i],cols[i]]= np.nan

# Show our dataset
example_dataset

    eyelash_length  subject_ID  birth_year group  sex
0         0.421559         0.0      1986.0   NaN    M
1         0.194937         1.0      1986.0     a    M
2         0.981964         2.0      1989.0     b    M
3         0.049875         3.0      1980.0     c    F
4         0.998879         4.0      1981.0     d  NaN
5         0.966870         5.0      1988.0     e    F
6         0.903859         6.0      1983.0     a  NaN
7         0.652425         7.0      1981.0     c    M
8         0.702245         8.0      1983.0     b    F
9         0.147186         9.0      1985.0     e    F
10        0.430119        10.0      1988.0     a    M
11        0.141627        11.0      1988.0     b    M
12        0.095632        12.0      1982.0     c    M
13        0.389472        13.0      1983.0     a    F
14        0.562067        14.0         NaN     b    M
15        0.440907        15.0      1986.0   NaN    F
16        0.973986        16.0      1988.0     d    F
17        0.892107        17.0      1986.0     e    M
18        0.715058        18.0      1989.0     e    F
19        0.558971        19.0      1986.0     e    F
20        0.368385        20.0      1986.0     d    M
21        0.714430        21.0      1985.0     c    F
22        0.565546        22.0      1987.0     d    M
23        0.754367        23.0      1985.0     a    F
24        0.863037        24.0      1982.0     e    F
25        0.983036         NaN      1989.0     b    M
26        0.958954        26.0      1980.0     c    F
27             NaN        27.0      1983.0     a    M
28        0.166066        28.0      1980.0     e    M
29        0.571246        29.0      1986.0     d    F
30        0.161439        30.0      1987.0     d    F
31        0.694601        31.0      1980.0     e    F
32             NaN        32.0      1988.0     a    M
33        0.585343        33.0      1983.0     c    F
34        0.837693        34.0      1983.0     b    F
35        0.107333        35.0      1983.0     e    F
36        0.583792        36.0      1981.0   NaN    M
37        0.582577        37.0      1988.0     b    F
38        0.769739        38.0      1987.0     c    M
39        0.283039        39.0      1987.0     a    M
40        0.492140        40.0      1988.0     d    F
41        0.630374        41.0      1984.0     d    M
42        0.803482        42.0      1984.0     a    M
43        0.072470        43.0      1980.0     b    F
44        0.139242        44.0      1986.0     b    F
45        0.614455        45.0      1987.0     c    F
46        0.155874        46.0      1988.0     e    M
47        0.933805        47.0      1982.0     c    F
48        0.803941        48.0      1986.0     d    M
49        0.735130        49.0      1986.0   NaN    F

### Boolean indexing

We can use Boolean indexing to return subsets of the data. What is particularly nice is that in `Pandas` boolean logic is much easier to interpret, due to the use of column names. For example, hopefully the below line of code should be fairly intuitive;

In [161]:
example_dataset[(example_dataset['sex']=='M') & 
                (example_dataset['birth_year']>1987)]

    eyelash_length  subject_ID  birth_year group sex
27        0.041389          27      1988.0     a   M

 > **Note:** When using multiple boolean statements always use `()` brackets to make your logic clearer and less susceptible to coding errors.

This above is useful but the notation is a bit clunky - we had to type `example_dataset` four times to do this operation. We can do this a lot more easily with the `query` function.

### Querying

We can perform the same operation as in the above section with much cleaner syntax using the `query` method like so:

In [162]:
example_dataset.query('(sex == "M") & (birth_year > 1987)')

    eyelash_length  subject_ID  birth_year group sex
27        0.041389          27      1988.0     a   M

 > **Warning:** The `query` function may have problems with column names which can't be used as python identifiers (for example column names including a space). This is a common cause of `SyntaxError`'s for users new to `Pandas`.

### Removing `NaN`s

When selecting data we may wish to first remove `NaN` values/missing data which could interfere with our logic. We can locate and remove all rows with `NaN` values in a specified column by using the `isna` function like so:

In [163]:
# Remove all subjects for whom we didn't record sex
example_dataset[~example_dataset.sex.isna()]

    eyelash_length  subject_ID  birth_year group sex
1         0.842962           1      1982.0     a   M
2         0.515679           2      1981.0     b   M
3         0.146900           3      1985.0     c   F
4         0.631964           4      1983.0     d   M
5         0.433166           5      1988.0     e   F
7         0.429555           7      1985.0     c   M
8         0.842564           8      1980.0     b   F
9              NaN           9      1982.0     e   F
10        0.706458          10      1986.0     a   M
12        0.653954          12      1980.0     c   M
13        0.652418          13      1981.0     a   F
14        0.046439          14      1985.0     b   M
15        0.152654          15      1980.0     c   F
16        0.945717          16      1985.0     d   F
17             NaN          17      1985.0     e   M
18        0.998294          18      1984.0     e   F
19        0.502654          19      1987.0     e   F
20             NaN          20      1983.0     d   M
21        0.704548          21      1983.0     c   F
22        0.819803          22      1980.0   NaN   M
23        0.056602          23      1989.0     a   F
24        0.101199          24      1983.0     e   F
26        0.700486          26      1985.0     c   F
27        0.041389          27      1988.0     a   M
28        0.659472          28      1980.0     e   M
29        0.579808          29      1983.0     d   F
30        0.671898          30      1986.0     d   F
31        0.294361          31      1983.0     e   F
32        0.175921          32      1981.0     a   M
33        0.465483          33      1986.0     c   F
34        0.881269          34      1985.0     b   F
35        0.825420          35      1984.0     e   F
36        0.198891          36      1983.0     a   M
37        0.296107          37      1988.0     b   F
38        0.358602          38      1982.0     c   M
39        0.945349          39      1980.0     a   M
40        0.219914          40      1986.0     d   F
41        0.882519          41      1984.0     d   M
42        0.235056          42      1983.0     a   M
43        0.787609          43      1986.0     b   F
44        0.651584          44      1982.0     b   F
45        0.815173          45      1980.0     c   F
46        0.774405          46      1984.0     e   M
47        0.639572          47      1989.0     c   F
48        0.392939          48      1986.0   NaN   M
49        0.493516          49      1981.0     b   F

There is actually a method that lets us do this more in a more neat fashion; the `dropna` method.

In [164]:
# Remove all subjects with missing sex and birthyear information
example_dataset.dropna(subset=['birth_year', 'sex'])

    eyelash_length  subject_ID  birth_year group sex
1         0.842962           1      1982.0     a   M
2         0.515679           2      1981.0     b   M
3         0.146900           3      1985.0     c   F
4         0.631964           4      1983.0     d   M
5         0.433166           5      1988.0     e   F
7         0.429555           7      1985.0     c   M
8         0.842564           8      1980.0     b   F
9              NaN           9      1982.0     e   F
10        0.706458          10      1986.0     a   M
12        0.653954          12      1980.0     c   M
13        0.652418          13      1981.0     a   F
14        0.046439          14      1985.0     b   M
15        0.152654          15      1980.0     c   F
16        0.945717          16      1985.0     d   F
17             NaN          17      1985.0     e   M
18        0.998294          18      1984.0     e   F
19        0.502654          19      1987.0     e   F
20             NaN          20      1983.0     d   M
21        0.704548          21      1983.0     c   F
22        0.819803          22      1980.0   NaN   M
23        0.056602          23      1989.0     a   F
24        0.101199          24      1983.0     e   F
26        0.700486          26      1985.0     c   F
27        0.041389          27      1988.0     a   M
28        0.659472          28      1980.0     e   M
29        0.579808          29      1983.0     d   F
30        0.671898          30      1986.0     d   F
31        0.294361          31      1983.0     e   F
32        0.175921          32      1981.0     a   M
33        0.465483          33      1986.0     c   F
34        0.881269          34      1985.0     b   F
35        0.825420          35      1984.0     e   F
36        0.198891          36      1983.0     a   M
37        0.296107          37      1988.0     b   F
38        0.358602          38      1982.0     c   M
39        0.945349          39      1980.0     a   M
40        0.219914          40      1986.0     d   F
41        0.882519          41      1984.0     d   M
42        0.235056          42      1983.0     a   M
43        0.787609          43      1986.0     b   F
44        0.651584          44      1982.0     b   F
45        0.815173          45      1980.0     c   F
46        0.774405          46      1984.0     e   M
47        0.639572          47      1989.0     c   F
48        0.392939          48      1986.0   NaN   M
49        0.493516          49      1981.0     b   F

###  Sorting data

One thing we may wish to do when first looking at data is sort it by a variable we are interested in. Sorting can be done in `pandas` using the `sort_values` method. For example;

In [165]:
sorted_example = example_dataset.sort_values('birth_year')
sorted_example

    eyelash_length  subject_ID  birth_year group  sex
45        0.815173          45      1980.0     c    F
39        0.945349          39      1980.0     a    M
8         0.842564           8      1980.0     b    F
28        0.659472          28      1980.0     e    M
22        0.819803          22      1980.0   NaN    M
15        0.152654          15      1980.0     c    F
12        0.653954          12      1980.0     c    M
49        0.493516          49      1981.0     b    F
2         0.515679           2      1981.0     b    M
32        0.175921          32      1981.0     a    M
13        0.652418          13      1981.0     a    F
44        0.651584          44      1982.0     b    F
38        0.358602          38      1982.0     c    M
1         0.842962           1      1982.0     a    M
9              NaN           9      1982.0     e    F
6         0.677836           6      1982.0     a  NaN
31        0.294361          31      1983.0     e    F
29        0.579808          29      1983.0     d    F
4         0.631964           4      1983.0     d    M
20             NaN          20      1983.0     d    M
21        0.704548          21      1983.0     c    F
42        0.235056          42      1983.0     a    M
36        0.198891          36      1983.0     a    M
24        0.101199          24      1983.0     e    F
35        0.825420          35      1984.0     e    F
41        0.882519          41      1984.0     d    M
18        0.998294          18      1984.0     e    F
46        0.774405          46      1984.0     e    M
3         0.146900           3      1985.0     c    F
34        0.881269          34      1985.0     b    F
11        0.195182          11      1985.0     b  NaN
7         0.429555           7      1985.0     c    M
26        0.700486          26      1985.0     c    F
14        0.046439          14      1985.0     b    M
17             NaN          17      1985.0     e    M
16        0.945717          16      1985.0     d    F
33        0.465483          33      1986.0     c    F
30        0.671898          30      1986.0     d    F
48        0.392939          48      1986.0   NaN    M
40        0.219914          40      1986.0     d    F
10        0.706458          10      1986.0     a    M
43        0.787609          43      1986.0     b    F
19        0.502654          19      1987.0     e    F
27        0.041389          27      1988.0     a    M
37        0.296107          37      1988.0     b    F
5         0.433166           5      1988.0     e    F
23        0.056602          23      1989.0     a    F
47        0.639572          47      1989.0     c    F
25        0.177098          25      1989.0     b  NaN
0         0.827086           0         NaN     a  NaN

If we want to get a row of the new sorted array, we can use the `iloc` function to index it like so:

In [166]:
sorted_example.iloc[0]

eyelash_length    0.815173
subject_ID              45
birth_year            1980
group                    c
sex                      F
Name: 45, dtype: object

 > **Note:** We can still select the index `0` of the array under it's original ordering using `loc`. It can be very easy to confuse the `loc` and `iloc` methods. It is always worth checking you are using the correct method here!

In [167]:
sorted_example.loc[0]

eyelash_length    0.827086
subject_ID               0
birth_year             NaN
group                    a
sex                    NaN
Name: 0, dtype: object

### Summarizing by column

Another great strength of the `pandas` package is that, much like `numpy`, it contains several methods for getting summary measures of columns of data. For example:

In [168]:
# Mean
example_dataset.mean()

eyelash_length       0.532925
subject_ID          24.500000
birth_year        1983.836735
dtype: float64

In [169]:
# Standard deviation
example_dataset.std()

eyelash_length     0.283714
subject_ID        14.577380
birth_year         2.656336
dtype: float64

In [170]:
# Count number of non-missing/non-NaN values
example_dataset.count()

eyelash_length    47
subject_ID        50
birth_year        49
group             48
sex               46
dtype: int64

One function which is useful as a sanity check whenever you are working in `pandas` is the `describe` method, which gives several common summary statistics of the data.

In [112]:
example_dataset.describe()

# (The percentages in this table are quantiles)

       eyelash_length  subject_ID   birth_year
count       30.000000   26.000000    28.000000
mean         0.488014   14.576923  1985.000000
std          0.296344    9.192053     3.126944
min          0.003995    0.000000  1980.000000
25%          0.242402    7.250000  1982.000000
50%          0.526452   14.500000  1985.000000
75%          0.780520   22.750000  1988.000000
max          0.937727   29.000000  1989.000000

We can also use our own custom functions to apply to the columns of a `DataFrame` using the `apply` method. For example:

In [171]:
# Make a T statistic for the t-test that
# the mean=1984
#
# i.e. T = (mean-1984)/(std/sqrt(n))
def tstat1984(series):
    
    # Get T statistic
    tStat = (series.mean()-1985)/(series.std()/np.sqrt(series.count()))
    
    return(tStat)

# Return the T statistics... they should all be large as the mean
# was not zero in any of our examples
example_dataset.select_dtypes(np.number).apply(tstat1984)

eyelash_length   -47952.529421
subject_ID         -950.982186
birth_year           -3.065447
dtype: float64

 > **Warning:** When applying custom functions to a `DataFrame` you must ensure you specify which datatypes you want to apply your function to. In the above we specified that we wanted to apply our function to any column containing entries that are `np.number` objects (i.e. `np.int64`, `np.float32`, etc...) using the `select_dtypes` function.

The `apply` method actually allows us to apply several functions at once. For example:

In [172]:
example_dataset.select_dtypes(np.number).apply([tstat1984, 
                                                'mean', 
                                                np.prod])

           eyelash_length  subject_ID     birth_year
tstat1984   -4.795253e+04 -950.982186  -3.065447e+00
mean         5.329249e-01   24.500000   1.983837e+03
prod         1.965868e-18    0.000000  3.782438e+161

### Summarizing by groupings

One extremely useful tool is the `groupby` tool which groups the data based on categorical variables of the users choosing. This returns an object, which we can iterate through like so:

In [173]:
for sex, table_for_category in example_dataset.groupby('sex'):
    
    print(f'Mean age for sex {sex}: {row.birth_year.mean()}')

Mean age for sex F: 1984.142857142857
Mean age for sex M: 1984.142857142857

A more common application of the `groupby` method, however, is combining it with the `apply` function to get summary measures for groups. This is an extremely powerful functionality.

In [174]:
example_dataset.groupby('group').mean()

       eyelash_length  subject_ID   birth_year
group
a            0.487270   20.818182  1983.500000
b            0.488705   26.700000  1984.200000
c            0.506693   24.700000  1983.500000
d            0.655303   25.714286  1984.285714
e            0.573621   23.200000  1984.000000

We can also take the intersection of multiple categories like so:

In [175]:
example_dataset.groupby(['sex','group']).mean()

           eyelash_length  subject_ID   birth_year
sex group
F   a            0.354510   18.000000  1985.000000
    b            0.658775   35.833333  1983.666667
    c            0.517831   27.142857  1984.000000
    d            0.604335   28.750000  1985.000000
    e            0.525849   20.142857  1984.428571
M   a            0.449432   26.714286  1983.285714
    b            0.281059    8.000000  1983.000000
    c            0.480703   19.000000  1982.333333
    d            0.757241   21.666667  1983.333333
    e            0.716938   30.333333  1983.000000

 > **Note:** If one of the entries in the above is `NaN` then there were no subjects of that sex in that group.

We can even do multiple groupings and multiple summary statistics at the same time!

In [176]:
# Get the mean and median for each (sex, group) combination 
example_dataset.groupby(['sex','group']).aggregate((np.median, np.mean))

          eyelash_length           subject_ID            birth_year  \
                  median      mean     median       mean     median
sex group
F   a           0.354510  0.354510       18.0  18.000000     1985.0
    b           0.719596  0.658775       40.0  35.833333     1983.5
    c           0.639572  0.517831       26.0  27.142857     1985.0
    d           0.625853  0.604335       29.5  28.750000     1985.5
    e           0.467910  0.525849       19.0  20.142857     1984.0
M   a           0.235056  0.449432       32.0  26.714286     1983.0
    b           0.281059  0.281059        8.0   8.000000     1983.0
    c           0.429555  0.480703       12.0  19.000000     1982.0
    d           0.757241  0.757241       20.0  21.666667     1983.0
    e           0.716938  0.716938       28.0  30.333333     1984.0


                  mean
sex group
F   a      1985.000000
    b      1983.666667
    c      1984.000000
    d      1985.000000
    e      1984.428571
M   a      1983.285714
    b      1983.000000
    c      1982.333333
    d      1983.333333
    e      1983.000000

We might also want to stratify based on a continuous variable. We can do this easily using the `cut` function like so:

In [177]:
# Split the years into groups and take their means
example_dataset.groupby(
    pd.cut(example_dataset.birth_year, 
           bins=(1979, 1983, 1986, 1990))).mean()

              eyelash_length  subject_ID   birth_year
birth_year
(1979, 1983]        0.545605   23.750000  1981.583333
(1983, 1986]        0.592382   26.222222  1985.111111
(1986, 1990]        0.306655   26.142857  1988.285714

### Reshaping

Suppose we were interested in the mean `eyelash_length` of every `group` for each `birth_year`. We could do the following;

In [178]:
example_dataset.groupby(['birth_year','group']).eyelash_length.mean()

birth_year  group
1980.0      a        0.945349
            b        0.842564
            c        0.540594
            e        0.659472
1981.0      a        0.414170
            b        0.504598
1982.0      a        0.760399
            b        0.651584
            c        0.358602
            e             NaN
1983.0      a        0.216973
            c        0.704548
            d        0.605886
            e        0.197780
1984.0      d        0.882519
            e        0.866039
1985.0      b        0.374297
            c        0.425647
            d        0.945717
            e             NaN
1986.0      a        0.706458
            b        0.787609
            c        0.465483
            d        0.445906
1987.0      e        0.502654
1988.0      a        0.041389
            b        0.296107
            e        0.433166
1989.0      a        0.056602
            b        0.177098
            c        0.639572
Name: eyelash_length, dtype: float64

However, we have 10 `birth_year`s and 5 `group`s. This leaves us with potentially up to 50 lines in the above table. In this example, we probably wouldn't worry too much but on real data this could result in us getting very large tables very quickly!

One way around this is to use the `unstack` method, which moves one of the groupings in the rows into the columns like so:

In [184]:
example_dataset.groupby(
                ['birth_year','group']
            ).eyelash_length.mean().unstack('group')

group              a         b         c         d         e
birth_year
1980.0      0.945349  0.842564  0.540594       NaN  0.659472
1981.0      0.414170  0.504598       NaN       NaN       NaN
1982.0      0.760399  0.651584  0.358602       NaN       NaN
1983.0      0.216973       NaN  0.704548  0.605886  0.197780
1984.0           NaN       NaN       NaN  0.882519  0.866039
1985.0           NaN  0.374297  0.425647  0.945717       NaN
1986.0      0.706458  0.787609  0.465483  0.445906       NaN
1987.0           NaN       NaN       NaN       NaN  0.502654
1988.0      0.041389  0.296107       NaN       NaN  0.433166
1989.0      0.056602  0.177098  0.639572       NaN       NaN

This shorter table is often referred to as "wide form" whilst the taller is referred to as "long form". 

There are many reasons you may want to work with both forms of data. for example, it often more convenient to group data using long form tables but often easier to generate plots with wide form tables. Often, it is also a question of personal preference.

You can convert wide form back to long form using the `stack` method like so:

In [227]:
# Unstack the dataframe
unstacked = example_dataset.groupby(
                ['birth_year','group']
            ).eyelash_length.mean().unstack('group')

# Stack the dataframe
stacked = unstacked.stack('group')

stacked

birth_year  group
1980.0      b        0.072470
            c        0.504415
            e        0.430333
1981.0      c        0.652425
            d        0.998879
1982.0      c        0.514719
            e        0.863037
1983.0      a        0.646665
            b        0.769969
            c        0.585343
            e        0.107333
1984.0      a        0.803482
            d        0.630374
1985.0      a        0.754367
            c        0.714430
            e        0.147186
1986.0      a        0.194937
            b        0.139242
            d        0.581190
            e        0.725539
1987.0      a        0.283039
            c        0.692097
            d        0.363492
1988.0      a        0.430119
            b        0.362102
            d        0.733063
            e        0.561372
1989.0      b        0.982500
            e        0.715058
dtype: float64

There are several alternatives to `stack` and `unstack`, such as  `pivot_table` and `melt`.

`pivot_table` is particularly useful as, not only does it unstack the table, but it also handles grouping at the same time. For example, we could perform the same unstacking operation we did early with `pivot_table` like so:

In [248]:
stacked = example_dataset.pivot_table('eyelash_length', 
                                      'birth_year', 
                                      'group')
stacked

group              a         b         c         d         e
birth_year
1980.0           NaN  0.072470  0.504415       NaN  0.430333
1981.0           NaN       NaN  0.652425  0.998879       NaN
1982.0           NaN       NaN  0.514719       NaN  0.863037
1983.0      0.646665  0.769969  0.585343       NaN  0.107333
1984.0      0.803482       NaN       NaN  0.630374       NaN
1985.0      0.754367       NaN  0.714430       NaN  0.147186
1986.0      0.194937  0.139242       NaN  0.581190  0.725539
1987.0      0.283039       NaN  0.692097  0.363492       NaN
1988.0      0.430119  0.362102       NaN  0.733063  0.561372
1989.0           NaN  0.982500       NaN       NaN  0.715058

We can unstack the table we just made with the `melt` method. This is a little more fiddly, however, as the previous example, using `pivot_table` has changed the `birth_year` variable from a column in the table to the row index.

In [262]:
# Change `birth_year` back to a column
stacked['birth_year'] = stacked.index

# Unstack our table
unstacked = pd.melt(stacked, id_vars=['birth_year'], value_vars=['a','b','c','d','e'],
         var_name='group', value_name='eyelash_length')

# Our table will not be in the original order but we can sort that
# After sorting the indices will be out of order so we reset those.
unstacked.sort_values(['birth_year', 'group']).reset_index()

    index  birth_year group  eyelash_length
0       0      1980.0     a             NaN
1      10      1980.0     b        0.072470
2      20      1980.0     c        0.504415
3      30      1980.0     d             NaN
4      40      1980.0     e        0.430333
5       1      1981.0     a             NaN
6      11      1981.0     b             NaN
7      21      1981.0     c        0.652425
8      31      1981.0     d        0.998879
9      41      1981.0     e             NaN
10      2      1982.0     a             NaN
11     12      1982.0     b             NaN
12     22      1982.0     c        0.514719
13     32      1982.0     d             NaN
14     42      1982.0     e        0.863037
15      3      1983.0     a        0.646665
16     13      1983.0     b        0.769969
17     23      1983.0     c        0.585343
18     33      1983.0     d             NaN
19     43      1983.0     e        0.107333
20      4      1984.0     a        0.803482
21     14      1984.0     b             NaN
22     24      1984.0     c             NaN
23     34      1984.0     d        0.630374
24     44      1984.0     e             NaN
25      5      1985.0     a        0.754367
26     15      1985.0     b             NaN
27     25      1985.0     c        0.714430
28     35      1985.0     d             NaN
29     45      1985.0     e        0.147186
30      6      1986.0     a        0.194937
31     16      1986.0     b        0.139242
32     26      1986.0     c             NaN
33     36      1986.0     d        0.581190
34     46      1986.0     e        0.725539
35      7      1987.0     a        0.283039
36     17      1987.0     b             NaN
37     27      1987.0     c        0.692097
38     37      1987.0     d        0.363492
39     47      1987.0     e             NaN
40      8      1988.0     a        0.430119
41     18      1988.0     b        0.362102
42     28      1988.0     c             NaN
43     38      1988.0     d        0.733063
44     48      1988.0     e        0.561372
45      9      1989.0     a             NaN
46     19      1989.0     b        0.982500
47     29      1989.0     c             NaN
48     39      1989.0     d             NaN
49     49      1989.0     e        0.715058

 > **Note:** Our table is now longer. This is because we have included `NaN`/missing values we didn't include in our original table. We could remove these easily though, for example, with the `dropna` method.

### Reading/Writing files

One final footnote on `pandas` we will mention is that it is extremely fast at reading and writing files.

`pandas` provides a wide range of tools for loading from text files, binary files, and SQL databases. The most commonly used function for this is the `pandas.read_{format}` function. For example, to read `csv` files we can do:

In [269]:
dataframe_from_csv = pd.read_csv('05_pandas/example_data.csv')

We can also write to a csv using the `pandas.to_csv`  like so:

In [275]:
X = pd.DataFrame(np.random.randn(1000,1000))

X.to_csv('05_pandas/example_data_we_made.csv')

This is one of the fastest file reading tools in Python and worth knowing about! For example, compare the time `pandas` took to read the example `csv` to the time `numpy` takes.

In [274]:
import time

# Let's time pandas
t1 = time.time()
array_from_csv = pd.read_csv('05_pandas/example_data.csv').values
t2 = time.time()
print('pandas took ', t2-t1, ' seconds to read the csv file.')

# Now time numpy
t1 = time.time()
array_from_csv = np.loadtxt('05_pandas/example_data.csv', delimiter=',')
t2 = time.time()
print('numpy took ', t2-t1, ' seconds to read the csv file.')

pandas took  0.353130578994751  seconds to read the csv file.
numpy took  0.7448122501373291  seconds to read the csv file.

## Using `pandas`

`pandas` is an extremely powerful tool. We have barely scratched the surface on it's capabilities here. To learn more, please see the official [`pandas` documentation here](https://pandas.pydata.org/).

# Exercises

**Question 1:** Read in the file `exercise_dataset.csv` as a pandas DataFrame. We are not interested in the `subject_id` and `age` variables so remove these from the DataFrame. *Hint: The [`drop`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html) function may be useful for this*.

In [107]:
# Write your answer here

**Question 2:** After collecting this data, you have found out that some, an extremely small minority in fact, of the subjects thought it would be funny to deliberately fill out the `favourite_animal` field in your survey with an object that is not an animal! Fearing these subjects may have filled out other values incorrectly, you wish to remove them from the DataFrame immediately.

Investigate the `.value_counts()` function in the [`Pandas` documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html). What does this function do? Use the function to find the rows of the DataFrame with non-animal responses in the `favourite_animal` column and remove the rows from the DataFrame.

In [113]:
# Write your answer here

**Question 3:** Your research is interested in the relationship between the size of the big toe on the left foot of each subject (`size_of_left_toe`) and the subjects heartrates (`heartrate`). Because of this, you have decided that you don't want to include any subjects which have any `NaN` values in either the `size_of_left_toe` or `heartrate` columns.

Remove all rows of the DataFrame which include `NaN` values in either the `size_of_left_toe` or `heartrate` columns.

In [116]:
# Write your answer here

**Question 4:** Write a function which takes in a numpy array and a percentage $k$ and returns the k% quantile of the array. Now apply it to the columns of your DataFrame. Check your results against the inbuilt pandas `quantile` function. *Note: You do not have to worry about interpolating values and you can use the `numpy sort` attribute for this question. However, **no other numpy functions** should be used!*


Use boolean indexing, and either your own function or the `quantile` function, to return a DataFrame containing only the subjects who were in the top 5\% quantile for `heartrate` and the bottom 5\% quantile for `size_of_left_toe`.

In [154]:
# Get quantile; assume quant is a decimal i.e. 0.05 for 5%
def myQuantile(inputArray, quant):
    
    # Sort the array
    sortedArray = np.sort(inputArray)
    
    # Work out index of quantile
    index = quant*len(inputArray)
    
    # We can get errors if they asked for 1\100%
    if index==len(inputArray):
        index = index-1
    
    return(sortedArray[np.int64(index)])
    
quantile(np.array([3,4,2,6,0,3]), 0.1)


# Apply to dataset
print('===============================')
print('My quantiles (0.05):')
print(example_dataset.select_dtypes(np.number).apply(myQuantile, quant=0.05))
print('Pandas quantiles (0.05):')
print(example_dataset.quantile(0.05))
print('===============================')
print('My quantiles (0.95):')
print(example_dataset.select_dtypes(np.number).apply(myQuantile, quant=0.95))
print('Pandas quantiles (0.95):')
print(example_dataset.quantile(0.95))

# Get the requested quantiles
upperHeartrate = example_dataset.heartrate.quantile(0.95)
lowerToeSize = example_dataset.size_of_left_toe.quantile(0.05)
print(upperHeartrate)
print(lowerToeSize)

# Get the requested data
example_dataset[(example_dataset['heartrate']>upperHeartrate) & 
                (example_dataset['size_of_left_toe']<lowerToeSize)]

===============================
My quantiles (0.05):
Unnamed: 0           249.000000
size_of_left_toe       0.051862
subject_ID          1453.000000
age                   12.000000
heartrate             62.081500
dtype: float64
Pandas quantiles (0.05):
Unnamed: 0           249.750000
size_of_left_toe       0.051364
subject_ID          1450.300000
age                   12.000000
heartrate             62.049362
Name: 0.05, dtype: float64
===============================
My quantiles (0.95):
Unnamed: 0          4748.000000
size_of_left_toe       0.962593
subject_ID          6016.000000
age                   58.000000
heartrate             98.500590
dtype: float64
Pandas quantiles (0.95):
Unnamed: 0          4747.250000
size_of_left_toe       0.949988
subject_ID          5947.700000
age                   57.000000
heartrate             97.971824
Name: 0.95, dtype: float64
97.97182421081158
0.05136418276205952

,Unnamed: 0,size_of_left_toe,subject_ID,age,group,heartrate,favourite_animal,sex,additional_info
68,68,0.018724,1268.0,58.0,A,99.786274,Goldfish,F,file_jaxsgelkzf.txt
165,165,0.002405,1365.0,39.0,A,98.907060,NaN,M,file_cldgkkcgwa.txt
276,276,0.012866,1476.0,58.0,B,99.495941,Mexican Mole Lizard,M,file_ruwvazmeat.txt
458,458,0.037736,1658.0,13.0,D,98.206047,hedgehog,M,file_hrfyngujcg.txt
463,463,0.018686,1663.0,44.0,A,99.480929,Shark,F,file_sllucsecev.txt
873,873,0.017485,2073.0,11.0,D,99.248824,giraffe,F,file_qqdbtyytdr.txt
904,904,0.010114,2104.0,53.0,D,98.814962,Goldfish,F,file_invwbscqwt.txt
1529,1529,0.043426,2729.0,40.0,C,98.915995,Shark,M,file_qsdqsjeinh.txt
1748,1748,0.000708,2948.0,33.0,B,98.652950,shrimp,F,file_ppilrzltbi.txt
2283,2283,0.039785,3483.0,39.0,C,99.007657,hedgehog,M,file_hznouvkfat.txt
2778,2778,0.049330,3978.0,47.0,C,98.730767,zebra,F,file_axnkjhepgt.txt
2917,2917,0.001474,4117.0,53.0,B,98.475487,Goldfish,M,file_dkgnvgeuus.txt
3678,3678,0.050355,4878.0,25.0,D,98.600964,cat,F,file_qwbeeyaxkg.txt
4098,4098,0.035179,5298.0,30.0,E,98.210011,Giant Otter,F,file_tstuqfregi.txt
4200,4200,0.027857,5400.0,49.0,D,98.992316,rhino,F,file_daltyxlpru.txt

**Question 5:** The range of the `age` column in the DataFrame is from 10 to 59 years old. Perform the following operations on the DataFrame;

 - Use the `cut` function to seperate subjects into 5 age groups, each of ten years in length. 

 - For each age range, obtain the mean `size_of_left_toe` and mean `heartrate` for both male (`M`) and female (`F`) subjects. Save a Dataframe containing these values as `mean_age_sex`. *Hint: Consider using the `groupby` function.*

 - For each age range, obtain the mean `size_of_left_toe` and `heartrate` for each of the groups listed in the `group` column (i.e. `a`, `b`, `c`, `d` and `e`). Save this in your workspace as `mean_age_group`. 

 - Stack `mean_age_sex` and `mean_age_group` on top of one another using the [`concat` function](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html). 
 

In practice, this is probably not a good way to lay out this data. List some reasons why you may not wish to lay out the data in this way.

In [104]:
# Write your answer here...